# Пример данных для вкладок, подвкладок и подподвкладок
tabs = {
    'Скрипты и Твики': {
        'Подвкладка 1': {
            'Подподвкладка 1': ['Элемент 1', 'Элемент 2'],
            'Подподвкладка 2': ['Элемент 3', 'Элемент 4']
        },
        'Подвкладка 2': {
            'Подподвкладка 3': ['Элемент 5', 'Элемент 6'],
            'Подподвкладка 4': ['Элемент 7', 'Элемент 8']
        }
    },
    'Твикеры и Программы': {
        'Подвкладка 3': {
            'Подподвкладка 5': ['Элемент 9', 'Элемент 10'],
            'Подподвкладка 6': ['Элемент 11', 'Элемент 12']
        },
        'Подвкладка 4': {
            'Подподвкладка 7': ['Элемент 13', 'Элемент 14'],
            'Подподвкладка 8': ['Элемент 15', 'Элемент 16']
        }
    }
}